{
  "10433047": {
    "bibtex": "@INPROCEEDINGS{10433047,\n  author={Mousavi, Seyed Amir and Sadeghi, Mostafa and Sirjani, Mohammad Sadegh},\n  booktitle={2023 14th International Conference on Information and Knowledge Technology (IKT)},\n  title={A Comparative Evaluation of Machine Learning Algorithms for IDS in IoT network},\n  year={2023},\n  volume={},\n  number={},\n  pages={168-174},\n  keywords={Measurement;Support vector machines;Logistic regression;Machine learning algorithms;Classification algorithms;Internet of Things;Ensemble learning;Network Security;Intrusion Detection System;Artificial Intelligence;Machine Learning},\n  doi={10.1109/IKT62039.2023.10433047}\n}"
  },
  "10496623": {
    "bibtex": "@INPROCEEDINGS{10496623,\n  author={Sirjani, Mohammad Sadegh and Mousavi, Seyed Amir and Sadeghi, Mostafa},\n  booktitle={2024 10th International Conference on Artificial Intelligence and Robotics (QICAR)},\n  title={Data Mining and Cloud Computing for Customer Pattern Analysis and Value Maximization},\n  year={2024},\n  volume={},\n  number={},\n  pages={339-344},\n  keywords={Industries;Cloud computing;Computational modeling;Switches;Probability;Predictive models;Turning;Data mining;Software engineering;Customer pattern analysis;Cloud computing;optimization},\n  doi={10.1109/QICAR61538.2024.10496623}\n}"
  },
  "10433027": {
    "bibtex": "@INPROCEEDINGS{10433027,\n  author={Mousavi, Seyed Amir and Sirjani, Mohammad Sadegh and Razavi, Seyyed Javad Bozorg Zadeh and Nikooghadam, Morteza},\n  booktitle={2023 14th International Conference on Information and Knowledge Technology (IKT)},\n  title={SecVanet: provably secure authentication protocol for sending emergency events in VANET},\n  year={2023},\n  volume={},\n  number={},\n  pages={86-91},\n  keywords={Resistance;Protocols;Vehicular ad hoc networks;Telecommunication traffic;Road safety;Computational complexity;Accidents;Authentication;Privacy;Key agreement;VANET;Scyther Tool},\n  doi={10.1109/IKT62039.2023.10433027}\n}"
  },
  "GHAFFARI2025101247": {
    "bibtex": "@article{GHAFFARI2025101247,\n  title = {QTE-IoT: Q-Learning-Based Task Scheduling Scheme to Enhance Energy Consumption and QoS in IoT Environments},\n  journal = {Sustainable Computing: Informatics and Systems},\n  pages = {101247},\n  year = {2025},\n  issn = {2210-5379},\n  doi = {https://doi.org/10.1016/j.suscom.2025.101247},\n  url = {https://www.sciencedirect.com/science/article/pii/S2210537925001684},\n  author = {Ali Ghaffari and Vesal Firoozi and Ali Maleki and Mohammad Sadegh Sirjani and Maedeh Abedini Bagha},\n  keywords = {Internet of things, Metaheuristic, Reinforcement learning, Task scheduling},\n  abstract = {As the proliferation of Internet of Things (IoT) devices continues unabated, the demand for efficient task scheduling mechanisms becomes increasingly critical. Task scheduling in the IoT is pivotal for optimizing resource utilization, minimizing latency, and enhancing the overall system’s performance. This research proposes a novel method called QTE-IoT, standing for a Q-learning-based task scheduling scheme to enhance energy consumption and QoS in IoT environments. QTE-IoT commences by categorizing tasks into three classes: time-sensitive tasks, security tasks, and normal tasks. This classification is achieved using a multi-layer perceptron artificial neural network. Subsequently, time-sensitive tasks are offloaded to the fog layer and scheduled using the proposed African Vulture Algorithm combined with Q-learning, which we designate as QAVA. Security tasks are offloaded to the private cloud, while normal tasks are offloaded to the public cloud. For task scheduling in private and public cloud environments, QTE-IoT employs a proposed enhanced version of Artificial Rabbits Optimization integrated with the Q-learning algorithm, known as QARO. Additionally, the QTE-IoT method incorporates a monitoring agent to oversee resource workload, thereby preventing congestion and delays. Simulation results on instances of the HCSP benchmark dataset demonstrate that QTE-IoT outperforms other state-of-the-art methods in various performance metrics. QTE-IoT achieves significant improvements compared to other methods and algorithms, including a 6% to 12% reduction in energy consumption. Furthermore, QTE-IoT exhibits substantial improvements in load imbalance (42% to 79%), response time (25% to 40%), and deadline satisfaction (6% to 39%) compared to existing approaches.}\n}"
  },
  "arXiv2509.07378": {
    "bibtex": "@misc{sirjani2025optimizingtaskschedulingfog,\n  title={Optimizing Task Scheduling in Fog Computing with Deadline Awareness},\n  author={Mohammad Sadegh Sirjani and Somayeh Sobati-Moghadam},\n  year={2025},\n  eprint={2509.07378},\n  archivePrefix={arXiv},\n  primaryClass={cs.DC},\n  url={https://arxiv.org/abs/2509.07378}\n}"
  },
  "Sirjani2025": {
    "bibtex": "@article{Sirjani2025,\n  author={Sirjani, Mohammad Sadegh and Maleki, Ali and Pakmehr, Amir and Abedini Bagha, Maedeh and Ghaffari, Ali and Pour Haji Kazem, Ali Asghar},\n  title={Controller placement in software-defined networks using reinforcement learning and metaheuristics},\n  journal={Cluster Computing},\n  year={2025},\n  month={9},\n  day={3},\n  volume={28},\n  number={10},\n  pages={660},\n  abstract={Software-defined networking (SDN) has revolutionized network management by enabling dynamic control and optimization of network resources. A key challenge in SDN deployment is the strategic placement and assignment of controllers, which significantly affects network performance in terms of energy consumption, latency, and load balancing. This research addresses the controller placement problem by proposing a two-step method that combines enhanced reinforcement learning with an improved metaheuristic algorithm, termed Bedbug-GLA. In the first step, an irregular cellular learning automata model is developed to determine the optimal number of controllers required. In the second step, the Bedbug metaheuristic algorithm is employed to efficiently assign controllers to switches. Simulation results demonstrate that Bedbug-GLA achieves up to an 18% improvement in maximum controller load, a 69% reduction in congested controller overload, and a 20% decrease in energy consumption compared to state-of-the-art metaheuristic approaches, as evaluated on standard network topologies derived from real-world datasets.},\n  issn={1573-7543},\n  doi={10.1007/s10586-025-05331-y},\n  url={https://doi.org/10.1007/s10586-025-05331-y}\n}"
  }
}
